# Z Field (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint..::..Z Field
CloudPoint Structure See Also
---
The Z coordinate
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public float Z
```

Visual Basic
---
```text
Public Z As Single
```

Visual C++
---
```text
public:
float Z
```

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace